// Процедура рассчитывает сумму по строке табличной части
//
// Параметры:
//  СтрокаТЧ - Строка табличной части, содержащая реквизиты "Количество", "Цена", "Сумма".
//
Процедура РассчитатьСумму(СтрокаТЧ) Экспорт

    СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;

КонецПроцедуры

// Функция возвращает строку с итоговой суммой числами и прописью
//
// Параметры:
//  СуммаИтого - Число - Сумма, которую нужно представить прописью.
//
// Возвращаемое значение:
//  Строка - Например: "Итого: 1 234.56 руб. / Одна тысяча двести тридцать четыре рубля 56 копеек"
//
Функция ИтоговоеЧислоПрописью(СуммаИтого) Экспорт

    Если СуммаИтого <> 0 Тогда

        ФормСтрока = "Л = ru_RU; дп = Ложь";
        ПарПредмета = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
        ПрописьЧисла = ЧислоПрописью(СуммаИтого, ФормСтрока, ПарПредмета);

        // Собираем итоговую строку
        СуммаИтогоПрописью = "Итого: " + Формат(СуммаИтого, "ЧДЦ=2") + " руб. / " + ПрописьЧисла;

    Иначе
        // Если сумма равна нулю, возвращаем специальную строку
        СуммаИтогоПрописью = "<<Без суммы>>"; // Или любой другой вариант, например, "Ноль рублей 00 копеек"

    КонецЕсли;

    Возврат СуммаИтогоПрописью;

КонецФункции