
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ВыпискаБанка.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыпискаБанка.Дата,
	|	ВыпискаБанка.Номер,
	|	ВыпискаБанка.Организация,
	|	ВыпискаБанка.РасчетныйСчет,
	|	ВыпискаБанка.ПоступлениеДС.(
	|		НомерСтроки,
	|		Контрагент,
	|		Сумма,
	|		Договор,
	|		НазначениеПлатежа
	|	)
	|ИЗ
	|	Документ.ВыпискаБанка КАК ВыпискаБанка
	|ГДЕ
	|	ВыпискаБанка.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПоступлениеДСШапка = Макет.ПолучитьОбласть("ПоступлениеДСШапка");
	ОбластьПоступлениеДС = Макет.ПолучитьОбласть("ПоступлениеДС");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПоступлениеДСШапка);
		ВыборкаПоступлениеДС = Выборка.ПоступлениеДС.Выбрать();
		Пока ВыборкаПоступлениеДС.Следующий() Цикл
			ОбластьПоступлениеДС.Параметры.Заполнить(ВыборкаПоступлениеДС);
			ТабДок.Вывести(ОбластьПоступлениеДС, ВыборкаПоступлениеДС.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
