Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Взаиморасчеты.Записывать = Истина;
	
	// Обрабатываем списание денег (мы платим поставщикам)
	// Приход - потому что гасим нашу кредиторку, долг уменьшается
	Для Каждого ТекСтрокаСписаниеДС Из СписаниеДС Цикл
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = ТекСтрокаСписаниеДС.Контрагент;
		Движение.Договор = ТекСтрокаСписаниеДС.Договор;
		Движение.Сумма = ТекСтрокаСписаниеДС.Сумма;
	КонецЦикла;

	// Обрабатываем поступление денег (клиенты нам платят)
	// Расход - потому что закрываем дебиторку, их долг перед нами уменьшается
	Для Каждого ТекСтрокаПоступлениеДС Из ПоступлениеДС Цикл
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = ТекСтрокаПоступлениеДС.Контрагент;
		Движение.Договор = ТекСтрокаПоступлениеДС.Договор;
		Движение.Сумма = ТекСтрокаПоступлениеДС.Сумма;
	КонецЦикла;
	
КонецПроцедуры