&НаКлиенте
Процедура ПересчетТЧ(Элемент)
    РаботаСДокументами.РассчитатьСумму(Элементы.ТабНоменклатура.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТабНоменклатураПриИзменении(Элемент)
    Объект.СуммаИтого = Объект.ТабНоменклатура.Итог("Сумма");
    Объект.СуммаИтогоПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаИтого);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Объект.СуммаИтого = Объект.ТабНоменклатура.Итог("Сумма");
    Объект.СуммаИтогоПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаИтого);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
    Если НЕ ПроверкаКонтрагента(Объект.Контрагент) Тогда
        ТекстСообщения = "Выбранный контрагент не является покупателем!
        |Очистить поле Контрагент?";
        Режим = РежимДиалогаВопрос.ДаНет;
        Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
        ПоказатьВопрос(Оповещение, ТекстСообщения, Режим);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
        Объект.Контрагент = Неопределено;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверкаКонтрагента(ВыбКонтрагент)
    Если ВыбКонтрагент = Неопределено Тогда
        Возврат Ложь;
    КонецЕсли;
    Возврат ВыбКонтрагент.ЭтоПокупатель;
КонецФункции

&НаКлиенте
Процедура ТабНоменклатураНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТабНоменклатура.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Цена = ПолучитьЦенуНоменклатуры(ТекущаяСтрока.Номенклатура);
		ТекущаяСтрока.Цена = Цена;
		РаботаСДокументами.РассчитатьСумму(ТекущаяСтрока);
		ТабНоменклатураПриИзменении(Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуНоменклатуры(Номенклатура)
	
	Если Номенклатура = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции